Revit 2027 API
ReferenceArrayArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ReferenceArrayArrayIterator ReverseIterator()
Public Overridable Function ReverseIterator As ReferenceArrayArrayIterator
public:
virtual ReferenceArrayArrayIterator^ ReverseIterator()
abstract ReverseIterator : unit -> ReferenceArrayArrayIterator
override ReverseIterator : unit -> ReferenceArrayArrayIterator
Return Value
ReferenceArrayArrayIterator
Returns a backward moving iterator to the array.
See Also
Reference
ReferenceArrayArray Class
Autodesk.Revit.DB Namespace